---
kind: other
id: Properties.T:Autodesk.Revit.DB.DesignOption
source: html/ddb7931b-6ed8-9f2b-f08e-e47215109c3d.htm
---
# DesignOption Properties

The id of the assembly instance to which the element belongs.